# Модуль 10. Объектно-ориентированное
# программирование
# Тема: Декораторы
# Задание 1
# Создайте функцию, возвращающую список со всеми
# простыми числами от 0 до 1000.
# Используя механизм декораторов посчитайте сколько
# секунд, потребовалось для вычисления всех простых чисел.
# Отобразите на экран количество секунд и простые числа.

import time


def timer(func):
	def wrapper():
		start = time.time()
		result = func()
		allTime = time.time() - start
		print(f'Поиск простых чисел выполнялся {allTime} с.')
		return result
	return wrapper


@timer
def prime_numbers():
    n: int = 1
    primeList = []
    
    while n <= 1000:
        for i in range(2,n):
            if n % i == 0:
                break
        else:
            primeList.append(n)
        n += 1
    return primeList


print(prime_numbers())















# Задание 2
# Добавьте к первому заданию возможность передавать
# границы диапазона для поиска всех простых чисел.
# Задание 3
# Каждый год ваша компания предоставляет различным
# государственным организациям финансовую отчетность.
# В зависимости от организации форматы отчетности разные. Используя механизм декораторов, решите вопрос
# отчетности для организаций.
